#### Maria Barrera  -- 02/21/2021

#### Employee SQL DB -- Import into Pandas

In [1]:
# Pandas
import pandas as pd

In [2]:
# SQL Alchemy
from sqlalchemy import create_engine

In [3]:
# import psycopg2 for DB connection
import psycopg2

#do not use
#Reference:  my postgres connection -- http://127.0.0.1:50506/browser/
#Create Engine

#HMWK SAMPLE:  
from sqlalchemy import create_engine
engine = create_engine('postgresql://localhost:5432/<your_db_name>')
connection = engine.connect()

engine = create_engine('postgresql://localhost:5432/employees_db')
conn = engine.connect()

In [17]:
# set-up DB connection
conn = psycopg2.connect(database ="employees_db",  
                            user = "postgres",  
                            password = "postgres",  
                            host = "localhost",  
                            port = "5432") 
conn

In [13]:
# Query All Records in the Database
employees_df = pd.read_sql("SELECT * FROM employees", conn)

In [14]:
# Preview the Data
employees_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [20]:
salaries_df = pd.read_sql("SELECT * FROM salaries", conn)
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [10]:
titles_df = pd.read_sql("SELECT * FROM titles", conn)
titles_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [11]:
departments_df = pd.read_sql("SELECT * FROM departments", conn)
departments_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [12]:
dept_emp_df = pd.read_sql("SELECT * FROM dept_emp", conn)
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [16]:
dept_manager_df = pd.read_sql("SELECT * FROM dept_manager", conn)
dept_manager_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [ ]:
# create a histogram

# ref:  https://www.geeksforgeeks.org/pandas-dataframe-hist-function-in-python/
# Importing pandas library 
import pandas as pd 
  
# Creating a Data frame 
values = pd.DataFrame({ 
    'Length': [2.7, 8.7, 3.4, 2.4, 1.9], 
    'Breadth': [4.24, 2.67, 7.6, 7.1, 4.9], 
    'Height': [5.8, 5.5, 7.8, 10.88, 0.1]}) 
  
# Creating Histograms of columns 'Length',  
# 'Breadth' and 'Height' using Dataframe.hist() 
# function 
hist = values.hist(bins=12)

SELECT salary, COUNT(*)
FROM salaries 
GROUP BY
	salary	
ORDER BY
	COUNT DESC, salary DESC
;

In [22]:
salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [25]:
# count the most common salary ranges for employees
salaries_count_df = salaries_df['salary'].value_counts()
salaries_count_df

40000    95346
55581       19
53738       18
53078       18
47454       17
         ...
74239        1
78148        1
76103        1
79114        1
81762        1
Name: salary, Length: 50355, dtype: int64

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.

In [ ]:
# create a bar chart of average salary by title